let scores = 0;

let q1 = prompt("Подумайте и скажите, какая вода замерзает быстрее? а)холодная б)горячая в)теплая");
if (q1 == "б") {
    scores = scores + 2 
    // scores += 2
} else {
    scores =0
}

alert(` ${scores} - результат `)

let q2 = prompt("Решите задачку: позавчера у Саши был день рождения. Послезавтра будет вторник. В какой день недели у Саши был день рождения? а)Четверг б)Пятница в)Суббота");
if(q2=="б"){
    scores = scores+2
}else{
    scores=scores
}
alert(` ${scores} - результат `)

let q3 = prompt("О чем идет речь: его называют «золотым» и оно уместно в неловких ситуациях. Если его назвать, то оно исчезнет. а)Слово б)Счастье в)Молчание");
if(q3=="в"){
    scores = scores+2
}else{
    scores=scores
}
alert(` ${scores} - результат `)

let q4 = prompt("Внимательно прочитайте задачу и дайте правильный ответ: летели галки, сели на палки. Сядут по одной - галка лишняя, сядут по две - палка лишняя. Сколько было палок и сколько было галок? а)Две палки и три галки б)Две галки и одна палка в)Три палки и четыре галки");
if(q4=="в"){
    scores = scores+2
}else{
    scores=scores
}
alert(` ${scores} - результат `)

let q5 = prompt("Щенок вместе с ошейником стоит 110 рублей, щенок дороже ошейника на 100 рублей. Сколько стоит ошейник? а)Пять рублей б)Два с половиной рубля в)Десять рублей");
if(q5=="а"){
    scores = scores+2
}else{
    scores=scores
}
alert(` ${scores} - результат `)

let q6 = prompt("В какой детской сказке слово «за» повторяется по принципу – сначала 2 раза, потом 3, потом 4, потом 5 и 6 раз? а)«Теремок» б)«Теремок» в)«Репка»");
if(q6=="в"){
    scores = scores+2
}else{
    scores=scores
}
alert(` ${scores} - результат `)

let q7 = prompt("Как вы думаете, почему власти США отдавали предпочтение летчикам-дальтоникам во время Второй Мировой войны? а)Они лучше распознают замаскированные объекты б)У них отличное зрение в темноте в)Они в совершенстве владеют искусством пилотирования");
if(q7=="а"){
    scores = scores+2
}else{
    scores=scores
}
alert(` ${scores} - результат `)

let q8 = prompt("Решите задачку: семья взяла на прокат 3 велосипеда и 2 скутера. У папы и мамы оказался разный транспорт, у папы и дочки – одинаковый, сын и мама уехали на разном. На чем поехала бабушка? а)На скутере б)На велосипеде в)Невозможно определить");
if(q8=="а"){
    scores = scores+2
}else{
    scores=scores
}
alert(` ${scores} - результат `)

let q9 = prompt("Прочитайте слова и скажите, какое слово выпадает по значению: рывок, движение, апатия  а)Рывок б)Движение в)Апатия");
if(q9=="в"){
    scores = scores+2
}else{
    scores=scores
}
alert(` ${scores} - результат `)



let q10 = prompt("Шмурдик боится как мышей, так и тараканов. а)Шмурдик не боится тараканов; б)Шмурдик боится мышей; в)шмурдик боится мышей больше, чем тараканов, но и тараканов боится тоже.");
if(q10=="б"){
    scores = scores+2
}else{
    scores=scores
}
alert(` ${scores} - результат `)

let q11 = prompt("Известно, что грымзик обязательно или полосат, или рогат, или то и другое вместе. а)грымзик не может быть безрогим; б)грымзик не может быть однотонным и безрогим одновременно; в)грымзик не может быть полосатым и безрогим одновременно.");
if(q11=="б"){
    scores = scores+2
}else{
    scores=scores
}
alert(` ${scores} - результат `)

let q12 = prompt("Если запырку отравить, то она сразу начнет пускать пузыри. а)если запырка пускает пузыри, то она была отравлена; б)если запырку не отравить, то она не будет пускать пузыри; в)если запырка не пускает пузыри, то она не отравлена.");
if(q12=="в"){
    scores = scores+2
}else{
    scores=scores
}
alert(` ${scores} - результат `)

let q13 = prompt("Все охлотушки умеют играть в шашки а)не бывает охлотушек, которые не умеют играть в шашки; б)все, кто умеет играть в шашки, являются охлотушками; в) не бывает охлотушек, которые умеют играть в шашки.");
if(q13=="а"){
    scores = scores+2
}else{
    scores=scores
}
alert(` ${scores} - результат `)

let q14 = prompt("Дубараторы бывают либо хорошими, либо плохими. Неправда, что этот дубаратор не плохой. а)этот дубаратор хороший; б)этот дубаратор средненький; в) этот дубаратор плохой.");
if(q14=="в"){
    scores = scores+2
}else{
    scores=scores
}
alert(` ${scores} - результат `)

let q15 = prompt("В природе обнаружено более десятка тиалей. Все обнаруженные тиали сплошь красного цвета. а)по крайней мере некоторые из тиалей красного цвета; б)по крайней мере некоторые из тиалей зеленые; в)некоторые тиали (из тех, что уже обнаружены) могут оказаться не красными.");
if(q15=="а"){
    scores = scores+2
}else{
    scores=scores
}
alert(` ${scores} - результат `)







